# 수집
    # File
    # 정형(RDB, File)
    # 준정형(Rest, Json, Mart, Meta)
    # 비정형(NoSQL, Hbase, Mongo, Craw, 댓글정보, 음원정보, 영상정보 등)
    # 포맷 및 가공 - 목표 / 분석 / 인사이트

# 분석 데이터 준비
    # 프로젝트마다 필요한 데이터만 다시 정렬
    # CSV 등 파일로 정리

# EDA
    # 데이터 분포 확인.
    # 타겟 선정
    # 분석대상 및 삭제대상 구분
    # 시각화
        # 바차트(Bar)
        # 박스플롯(Boxplot)
        # 산점도(Scatter)
        # 히스토그램(Hist)
    # 상관분석 (차트)

# 전처리 / 가공 (Pre-processing, Engineering)
    # 정규화 / 표준화 (Scaling)
    # 결측처리 (inNull)
    # 이상치 (Outlier)
    # 불필요 Fiture 삭제 (PCA, Drop)

# 모델(알고리즘) 선정 - 100라인 Copy
    # 학습
    # 평가
    # 검증
    # 튜닝

# 검증 프레젠테이션 준비
    # 현안에서의 최선임을 강조
    # 왜 이게 최선인지를 설명
    # 해당 분석과정을 상세하게 설명
        # 데이터를 어떻게 전처리를 했고, 어떤 알고리즘을 사용했는데 결과가 안좋았다.
        # 튜닝을 다시했는데 결과가 안좋아서 알고리즘을 바꿨는데 결과가 안좋았다.
        # 이상치와 결측치를 다르게 사용하여 첫 번쨰 알고리즘을 사용했는데 결과가 안좋았다.
        # 알고리즘을 다르게 사용했는데 결과가 그나마 가장 나았다.
        # 튜닝을 해서 나온 결과가 이렇게 되었다.
        
        
# ========== ========== ==========


# 분석
# 머신러닝
    # 지도학습 : 회귀 / 분류(NN)
    # 비지도학습 : 군집
# 딥러닝
    # 퍼셉트론 - 뉴럴(신경망) - 다층신경망 - 인공지능망 ...
# 인공지능
    # 추천
    # 자연어/텍스트/챗봇
    # 음원/영상/이미지